let kilometers = 10; //кількість кілометрів до роботи
let speed_1 = 5; //кількість кілометрів, які я пройду за годину
let speed_2 = 60; //кількість кілометрів, які я подолаю скористаючись транспортом за годину

let road_1 = kilometers*0.2; //20% дороги я долаю пішки
let road_2 = kilometers*0.8; //80% дороги я їду на транспорті

let time_1 = road_1 / speed_1; //скільки год я йду пішки
let time_2 = road_2 / speed_2; //скільки год я їду транспортом

let road_time = (time_1 + time_2)*60; //час який я витрачаю на дорогу, в хвилинах

сonsole.log (road_time);